src/app/Http/Controllers/UserController.php

    public function index()
    {
        // getはIlluminate\Support\Collectionを返す
        $users = DB::table('users')->get();

        // dd($users);
        // // 1件取得
        // $user = DB::table('users')->where('name', 'John')->first();

        // 全カラムは必要ない場合、valueメソッドにより一つの値のみ取得
        // $email = DB::table('users')->where('name', 'John')->value('email');
        // dd($email);

        // idカラム値により１行取得する場合
        // $user = DB::table('users')->find(1);
        // dd($user);

        // 単一カラムの値をコレクションで取得したい場合
        // $titles = DB::table('users')->pluck('name');
        // dd($titles);

        // 取得コレクションのキーカラムを指定することもできます。
        $roles = DB::table('users')->pluck('id', 'name');
---
SELECT * FROM `users`
SELECT `id`, `name` FROM `users`

        //     });

        // 集計
        $users = DB::table('users')->count();
        $price = DB::table('users')->max('id');
---
SELECT count(*) as aggregate FROM `users`
SELECT max(`id`) as aggregate FROM `users`